"""あなたは質問に対して、回答を返してください
    質問:{question}
    回答:""""""あなたは回答を入力として受け取り、その回答を元に次に質問したり、問い合わせたりした方がいい質問を5つ箇条書きで生成してください
        回答:{response}
        質問""""""
        以下が回答を3つのキーワードに分割した例です。
        ---
        回答: - 寿司
        - ラーメン
        - カレーライス
        - ピザ
        - 焼肉
        キーワード: 寿司 ラーメン カレーライス
        ---
        ---
        回答: 織田信長は、戦国時代の日本で活躍した武将・戦国大名です。信長は、尾張国の織田家の当主として生まれ、若い頃から戦国時代の混乱を乗り越えて勢力を拡大しました。政治的な手腕も備えており、国内の統一を目指し、戦国大名や寺社などとの同盟を結びました。彼の統一政策は、後の豊臣秀吉や徳川家康による天下統一に繋がっていきました。
        信長の死は、本能寺の変として知られています。彼は家臣の明智光秀によって襲撃され、自害に追い込まれました。しかし、彼の業績や影響力は、その後の日本の歴史に大きく残りました。
        キーワード: 織田信長 戦国時代 本能寺
        ---
        回答:{response}
        キーワード""""""あなたは回答と検索結果の内容を入力として受け取り、回答と検索結果を参考に次にするべき質問を5以上生成してください。
        生成結果の先頭は必ず順番に1. 2. と数字を必ず記載して生成してください。
        回答:{response}
        検索結果の内容:{bing_search}
        質問""""""
        以下が回答を3つのキーワードに分割した例です。
        ---
        回答: - 寿司
        - ラーメン
        - カレーライス
        - ピザ
        - 焼肉
        キーワード: 寿司 ラーメン カレーライス
        ---
        ---
        回答: 織田信長は、戦国時代の日本で活躍した武将・戦国大名です。信長は、尾張国の織田家の当主として生まれ、若い頃から戦国時代の混乱を乗り越えて勢力を拡大しました。政治的な手腕も備えており、国内の統一を目指し、戦国大名や寺社などとの同盟を結びました。彼の統一政策は、後の豊臣秀吉や徳川家康による天下統一に繋がっていきました。
        信長の死は、本能寺の変として知られています。彼は家臣の明智光秀によって襲撃され、自害に追い込まれました。しかし、彼の業績や影響力は、その後の日本の歴史に大きく残りました。
        キーワード: 織田信長 戦国時代 本能寺
        ---
        回答:{response}
        キーワード""""""あなたは検索結果の内容を入力として受け取り、要約を最大で5つ箇条書きで生成してください。
        生成結果の先頭は必ず順番に1. 2. と数字を必ず記載して生成してください。
        検索結果の内容:{bing_search}
        要約""""""あなたは回答を入力として受け取り、回答を表す3つ単語に変換してください。
        以下が単語リストの生成例です。
        ---
        回答: - 寿司
        - ラーメン
        - カレーライス
        - ピザ
        - 焼肉
        単語リスト: 寿司 ラーメン カレーライス
        ---
        ---
        回答: 織田信長は、戦国時代の日本で活躍した武将・戦国大名です。信長は、尾張国の織田家の当主として生まれ、若い頃から戦国時代の混乱を乗り越えて勢力を拡大しました。政治的な手腕も備えており、国内の統一を目指し、戦国大名や寺社などとの同盟を結びました。彼の統一政策は、後の豊臣秀吉や徳川家康による天下統一に繋がっていきました。
        信長の死は、本能寺の変として知られています。彼は家臣の明智光秀によって襲撃され、自害に追い込まれました。しかし、彼の業績や影響力は、その後の日本の歴史に大きく残りました。
        単語リスト: 織田信長 戦国時代 本能寺
        ---
        回答:{response}
        単語リスト""""""あなたは検索結果の内容を入力として受け取り、要約を最大で5つ箇条書きで生成してください。
        生成結果の先頭は必ず順番に1. 2. と数字を必ず記載して生成してください。
        検索結果の内容:{wiki_search}
        要約"""