from langchain.prompts import (
    PromptTemplate,
    AIMessagePromptTemplate,
    HumanMessagePromptTemplate,
)

few_shot_human1 = HumanMessagePromptTemplate.from_template("1、投资者通过基金管理人直销中心柜台首笔申购本基金份额的最低限额为人\n民币10,000元(含申购费,下同),追加申购单笔最低限额为人民币1,000元。投\n资者通过基金管理人电子直销交易系统及其他销售机构首笔申购本基金份额的最\n低限额为人民币1元,追加申购单笔最低限额为人民币1元。各销售机构可根据\n自己的情况调整首次申购最低金额和追加申购最低金额限制。各销售机构对本基\n金最低申购金额及交易级差有其他规定的,以各销售机构的业务规定为准。\n    2、基金份额持有人可将其持有的全部或部分基金份额赎回,单笔赎回不得少\n于1份,但某笔交易类业务(如赎回、基金转换等)导致单个基金交易账户的基金\n份额余额少于1份时,基金管理人有权对该部份剩余基金份额发起一次性自动全\n部赎回。")

result1='''
{{
	"限额项目": "申购最低额",
	"销售方式": "直销中心柜台",
	"是否含申购费": "含",
	"金额数": "10000",
	"单位": "元"
}}
'''

result2='''
{{
	"限额项目": "追加申购最低额",
	"销售方式": "直销中心柜台",
	"是否含申购费": "含",
	"金额数": "1000",
	"单位": "元"
}}
'''

result3='''
{{
	"限额项目": "申购最低额",
	"销售方式": "电子直销交易系统/其他销售机构",
	"是否含申购费": "含",
	"金额数": "1",
	"单位": "元"
}}
'''

result4='''
{{
	"限额项目": "追加申购最低额",
	"销售方式": "电子直销交易系统/其他销售机构",
	"是否含申购费": "含",
	"金额数": "1",
	"单位": "元"
}}
'''

result5='''
{{
	"限额项目": "赎回最低额",
	"销售方式": "",
	"是否含申购费": "",
	"金额数": "1",
	"单位": "份"
}}
'''

result6='''
{{
	"限额项目": "账户持有份额下限",
	"销售方式": "",
	"是否含申购费": "",
	"金额数": "1",
	"单位": "份"
}}
'''

few_shot_ai_template1 = f'''
[
	{result1},
	{result2},
	{result3},
	{result4},
	{result5},
	{result6}
]
'''

few_shot_ai1 = AIMessagePromptTemplate.from_template(few_shot_ai_template1)